export const NEWS_CATEGORIES = [
  "Общее",
  "Важно",
  "События",
  "Назначения",
  "Учебные мероприятия",
] as const;

export const ORDER_CATEGORIES = [
  "Общий",
  "По личному составу",
  "По строевой части",
  "Дисциплинарный",
  "По боевой подготовке",
] as const;

export const ORDER_STATUSES = [
  "Действует",
  "Отменён",
  "Утратил силу",
  "В разработке",
] as const;

export const DEPARTMENTS = [
  "ФСО",
  "УСН",
  "Штаб",
  "Кадровый аппарат",
] as const;

export const RANKS = [
  "Рядовой",
  "Младший сержант",
  "Сержант",
  "Старший сержант",
  "Старшина",
  "Прапорщик",
  "Старший прапорщик",
  "Лейтенант",
  "Старший лейтенант",
  "Капитан",
  "Майор",
  "Подполковник",
  "Полковник",
  "Генерал-майор",
  "Генерал-лейтенант",
  "Генерал-полковник",
  "Директор",
] as const;
